Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: དེ་བཞིན་དུ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སེམས་བསྐྱེད་པའི་རྡོ་རྗེའི་ལག་ཅ་ཆེན་པོ་ཡང་གཞན་དུ་ན་བྱང་ཆུབ་སེམས་དཔའ་ཆེན་པོ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་རྒྱུའི་སྟོབས་ཀྱིས་བརྟན་པ་དགེ་བའི་རྩ་བ་ཚད་མེད་པའི་མཐུ་བོ་ཆེ་ཆེན་པོའི་སྟོབས་ལྟར་ཁྱད་པར་དུ་འཕགས་པ་སྟོབས་ཀྱི་ཤུགས་ཆེན་པོ་རབ་ཏུ་ཐོབ་པ་མ་གཏོགས་པར་ཉན་ཐོས་དང་རང་སངས་རྒྱས་སྟོབས་པོ་ཆེ་ཐམས་ཅད་ཀྱིས་ཀྱང་ཡོངས་སུ་གཟུང་བར་མི་ནུས་སོ། །
en: In the same way, the great diamond weapon of the development of the aspiration to omniscience can only be acquired by a great bodhisattva whose limitless roots of merit are made firm by the power of the cause of omniscience, which has superior powerful strength and might like that of the great Nārāyaṇa. Otherwise, it cannot be held by any other strongmen, who are the śrāvakas and pratyeka­buddhas.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། མཚོན་ཆ་ཐམས་ཅད་ཀྱིས་མི་ཚུགས་པ་གང་དུ་ཡང་རྡོ་རྗེས་མི་ཚུགས་པ་མེད་དེ་ཁ་མི་འབབ་བོ། །
en: “Noble one, a diamond can pierce what no other weapon can pierce, without itself being damaged.

source: དེ་བཞིན་དུ་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། གདུལ་བའམ། དུས་གསུམ་གྱི་བསྐལ་པར་སྤྱད་པའི་སྡུག་བསྔལ་དང་འགྲོགས་པར་བྱ་བ་གང་དུ་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་སྨོན་ལམ་དང་ཡེ་ཤེས་ཀྱི་མཚོན་ཆས་རྡུགས་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སེམས་བསྐྱེད་པའི་རྡོ་རྗེའི་མཚོན་ཆ་ཆེན་པོ་ཐོགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཡོངས་སུ་སྐྱོ་བའི་ཡིད་མེད་པས་ནི་མི་བཟོད་པ་མེད་དེ།
en: In the same way, wherever the weapons of the prayers and wisdom of śrāvakas and pratyeka­buddhas are ineffective in ripening and guiding beings, or in associating with the suffering that is experienced during the kalpas of the three times, there the bodhisattva who wields the great diamond weapon of the development of the aspiration to omniscience is effective without weariness of mind, and without it being unendurable, and without being adversely affected by it.

source: ཁ་མི་འབབ་བོ། །རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། རྡོ་རྗེ་ནི་གཞན་དུ་ན་རྡོ་རྗེ་ཉིད་ལས་གྱུར་པའི་གཞི་མ་གཏོགས་པར་སའི་ཕྱོགས་གང་གིས་ཀྱང་གཟུང་བར་མི་ནུས་སོ། །
en: “Noble one, a diamond can only be contained in a ground made of diamond and not in any other place.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའི་འབྱུང་བའི་སྨོན་ལམ་གྱི་ཚོགས་རྡོ་རྗེ་ནི་གཞན་དུ་ན་ལྷག་པའི་བསམ་པས་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་རྡོ་རྗེ་བརྟན་པའི་ས་གཞི་མ་གཏོགས་པར། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་གཟུང་བར་མི་ནུས་སོ། །
en: In the same way, only the strong diamond ground of the development of the aspiration to omniscience can contain the diamond of the accumulations of the prayers that arise from a bodhisattva, so that śrāvakas and pratyeka­buddhas cannot possess it.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། རྒྱ་མཚོ་ཆེན་པོའི་སྣོད་རྡོ་རྗེའི་གཞི་སྲ་ཞིང་གསེབ་མེད་པས་ཆུ་གསང་དུ་འཛག་པར་མི་འགྱུར་རོ། །
en: “Noble one, the container of the great ocean is the diamond ground that is solid and without fissures so that water cannot leak through the cracks.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའི་དགེ་བའི་རྩ་བ་བྱང་ཆུབ་ཀྱི་སེམས་རྡོ་རྗེ་གསེབ་མེད་པ་ཡོངས་སུ་བསྔོས་པའི་གཞི་ཅན་ལ་གནས་པ་ཡང་སྲིད་པར་སྐྱེ་བ་ཐམས་ཅད་ཀྱིས་ཟད་པར་མི་འགྱུར་རོ། །རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན།
en: In the same way, the roots of merit of a bodhisattva that rest on the uncracked ground of dedication of the diamond of the development of the aspiration to enlightenment will never be exhausted throughout all existences.

source: རྡོ་རྗེའི་གཞི་ལ་བརྟེན་པའི་ས་ཆེན་པོ་ནི་འཇིག་པར་མི་འགྱུར་རོ། །དམའ་བར་མི་འགྱུར་རོ། །
en: “Noble one, the great earth that rests on a foundation of diamond will never be destroyed and will never degenerate.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་རྡོ་རྗེ་སྲ་བའི་གཞི་ལ་བརྟེན་པའི་བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་རྣམས་ཀྱང་ཁམས་གསུམ་ཐམས་ཅད་དུ་འཇིག་པར་མི་འགྱུར་དམའ་བར་མི་འགྱུར་རོ། །
en: In the same way, the bodhisattva prayers that are based upon the solid diamond ground of the development of the aspiration to enlightenment will never be destroyed and will never degenerate.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། རྡོ་རྗེ་ནི་ཆུས་བངས་པའམ་རུལ་བར་མི་འགྱུར་རོ། །
en: “Noble one, a diamond will not rot if immersed in water.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་རྡོ་རྗེ་ཡང་ལས་དང་ཉོན་མོངས་པ་ཐམས་ཅད་ཀྱི་ཆུར་བསྐལ་པར་གནས་ཀྱང་རུལ་བར་མི་འགྱུར་བངས་པར་མི་འགྱུར་རོ། །
en: In the same way, the diamond of the development of the aspiration to enlightenment will not become rotten even if it remains for a kalpa in the water of all karma and kleśas.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། རྡོ་རྗེ་ནི་མེ་ཐམས་ཅད་ཀྱི་དྲོད་ཀྱིས་ཀྱང་ཚིག་པར་མི་འགྱུར་ཡོངས་སུ་གདུང་བར་ཡང་མི་འགྱུར་རོ། །
en: “Noble one, a diamond will not be burned or scorched by the heat of fire.

source: དེ་བཞིན་དུ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སེམས་བསྐྱེད་པ་རྡོ་རྗེ་ཡང་འཁོར་བ་ཐམས་ཅད་ཀྱི་སྡུག་བསྔལ་གྱི་མྱེའི་དྲོད་ཐམས་ཅད་ཀྱིས་མི་ཚིག་གོ །ཉོན་མོངས་པ་ཐམས་ཅད་ཀྱི་མྱེའི་གདུང་བས་གདུང་བར་མི་འགྱུར་རོ། །
en: In the same way, the diamond of the development of the aspiration to omniscience will not be burned by the heat of the fire of the sufferings of all saṃsāra and will not be scorched by the burning fire of all the kleśas.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སྙིང་པོ་བྱང་ཆུབ་ལ་བཞུགས་ཤིང་། བདུད་རྒོལ་ཏུ་གཞུག་པ་མཛད་པ་དང་། ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་རྣམས་ཀྱི་གདན་ནི་གཞན་དུ་ན་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྡོ་རྗེའི་ལྟེ་བའི་སའི་གཞི་མ་གཏོགས་པར་སའི་ཕྱོགས་གཞན་གྱིས་གཟུང་བར་མི་ནུས་སོ། །དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སྨོན་ལམ་འདེབས་པ་དང་སྤྱད་པ་སྤྱོད་པ་དང་། ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་དང་། བཟོད་པ་ལ་འཇུག་པ་དང་ས་ཐོབ་པར་བྱེད་པ་དང་།
en: “Noble one, when a tathāgata arhat samyak­saṃbuddha sits on the bodhimaṇḍa, overcomes the māras, and attains omniscient buddhahood, no place can be its location other than the ground that is the diamond center of a world realm of a billion worlds.

source: དགེ་བའི་རྩ་བ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་དང་། ལུང་བསྟན་པ་ཡོངས་སུ་ནོད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ལམ་གྱི་ཚོགས་ཐམས་ཅད་ཉེ་བར་སྟོན་པ་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ལ་མཆོད་པ་བྱེད་པ་དང་། ཆོས་ཀྱི་སྤྲིན་ཆེན་པོ་ཡོངས་སུ་འཛིན་པ་རྣམས་ཀྱི་དགེ་བའི་རྩ་བའི་སྟོབས་དང་ཤུགས་དང་དྲག་ཤུལ་དེ་དག་ཀྱང་གཞན་དུ་ན་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སེམས་བསྐྱེད་པ་སྨོན་ལམ་ཐམས་ཅད་ཀྱི་ཡེ་ཤེས་རྡོ་རྗེ་སྲ་བའི་ལྟེ་བ་ཅན་མ་གཏོགས་པར་སེམས་ཅན་གཞན་གྱིས་ཡོངས་སུ་གཟུང་བར་མི་ནུས་སོ། །
en: In the same way, all the strength, power, and might of the bodhisattvas’ roots of merit from their prayers for the attainment of the highest, complete enlightenment, their entry into patience, their attainment of the bhūmis, their completion of the roots of merit, their receiving their prophecy, their reliance on all the accumulations of the bodhisattva path, their making offerings to all the tathāgatas, and their holding all the great clouds of the Dharma can only be located on the solid diamond center of the wisdom of all the prayers for the development of the aspiration to omniscience, and other beings will not be able to possess it.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སེམས་བསྐྱེད་པ་ནི་ཡོན་ཏན་དེ་དག་དང་གཞན་ཚད་མེད་པ་ནས། ཡོན་ཏན་གྱི་ཁྱད་པར་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པ་དང་ལྡན་པ་སྟེ།
en: “Noble one, the development of the aspiration to omniscience has those qualities and countless others; it possesses an indescribable extent of indescribable special qualities.

source: སེམས་ཅན་གང་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་དེ་དག་ཀྱང་། ཡོན་ཏན་གྱི་ཆོས་དེ་ལྟ་བུ་དང་ལྡན་པར་གྱུར་ཏོ། །ལྡན་པར་འགྱུར་རོ། །
en: Any being who develops the aspiration to the highest, complete enlightenment possesses the phenomena of such qualities and will possess them going forward.

source: དེ་བས་ན་རིགས་ཀྱི་བུ་དེ་ལྟར་ཁྱོད། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དེ། ཡོན་ཏན་འདི་དག་རབ་ཏུ་ཐོབ་པར་བྱ་བའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཡོངས་སུ་ཚོལ་བ་ནི་ཁྱོད་ཀྱིས་ཐོབ་པར་བྱ་བ་ལེགས་པར་ཐོབ་བོ། །
en: “Therefore, noble one, you have gained an excellent attainment in developing the aspiration to the highest, complete enlightenment, and in order to attain these qualities you have sought bodhisattva conduct.

source: རིགས་ཀྱི་བུ་ཁྱོད་ན་རེ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་སྤྱད་པར་བྱ།
en: “Noble one, you asked, ‘How does one perform bodhisattva conduct?

source: ཇི་ལྟར་ནན་ཏན་དུ་བྱ་ཞེས་ཟེར་བ་ནི་རིགས་ཀྱི་བུ་ཁང་པ་བརྩེགས་པ་ཆེན་པོ་རྣམ་པར་སྣང་མཛད་ཀྱི་རྒྱན་གྱིས་བརྒྱན་པའི་སྙིང་པོ་འདི་ཉིད་ཀྱི་ནང་དུ་སོང་སྟེ་ལྟོས་ཤིག་དང་།
en: How does one practice it?’ “Noble one, go inside the great kūṭāgāra called Vairocana­vyūhālaṃkāra­garbha and look!

source: དེར་ཁྱོད་ཀྱིས་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བྱ་བ་དང་། བསླབས་ནས་ཀྱང་ཡོན་ཏན་ཇི་ལྟ་བུ་ཡོངས་སུ་འགྲུབ་པར་འགྱུར་བ་ཤེས་པར་འགྱུར་རོ། །
en: You will then know how a bodhisattva should train in bodhisattva conduct and, having trained, what kind of qualities will be accomplished.”

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པ་ལ་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ཏེ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: Sudhana, the head merchant’s son, circumambulated the bodhisattva Maitreya, keeping him to his right, and then said, “Ārya, open the door of the kūṭāgāra.

source: འཕགས་པ་ཕོ་བྲང་བརྩེགས་པའི་ཆབ་སྒོ་དབྱེར་གསོལ་ནང་དུ་མཆིའོ། །
en: I am going to enter.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པས་ཁང་པ་བརྩེགས་པ་རྣམ་པར་སྣང་མཛད་ཀྱི་རྒྱན་གྱིས་བརྒྱན་པའི་སྙིང་པོའི་སྒོ་དྲུང་དུ་ཕྱིན་ཏེ།
en: The bodhisattva Maitreya came in front of the door of the Vairocana­vyūhālaṃkāra­garbha kūṭāgāra.

source: ལག་པ་གཡས་པས་སེ་གོལ་གཏོགས་ཏེ། སྒྲ་ཕྱུང་བ་དང་། དེའི་སྒོ་དེ་ཡང་རང་བྱེ་བར་གྱུར་པ་དང་། དེས་སྨྲས་པ།
en: With his right hand he snapped his fingers, and with that sound the door opened.

source: རིགས་ཀྱི་བུ་ད་ཁང་པ་བརྩེགས་པ་འདིར་སོང་ཤིག །
en: He said, “Noble son, enter the kūṭāgāra.”

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ངོ་མཚར་ཆེན་པོ་ཐོབ་པར་གྱུར་ཏེ། ཁང་པ་བརྩེགས་པ་དེའི་ནང་དུ་ཕྱིན་པ་དང་།
en: Sudhana, the head merchant’s son, was greatly amazed, and he entered the kūṭāgāra.

source: ཕྱིན་མ་ཐག་ཏུ་སྒོ་དེ་ཡང་རང་ཆད་པར་གྱུར་ཏོ། །དེས་མཐོང་བ་ཁང་པ་བརྩེགས་པ་དེ་ཤིན་ཏུ་རྒྱ་ཆེ་ཞིང་ཡངས་ལ་རྒྱར་དཔག་ཚད་བརྒྱ་སྟོང་མང་པོ་དང་ལྡན་པ། ནམ་མཁའི་དབྱིངས་ཀྱི་ཚད་ཀྱིས་གཞལ་བ། འཁོར་ཐམས་ཅད་དུ་ནམ་མཁའི་དབྱིངས་ལྟར་ཡངས་པ། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་གྱི་རྒྱན་གྲངས་མེད་པས་བརྒྱན་པ། རིན་པོ་ཆེ་གྲངས་མེད་པའི་རྒྱན་གྱིས་བརྒྱན་པ། མུ་ཏིག་གི་ཕྲེང་བ་གྲངས་མེད་པ་རབ་ཏུ་སྦྱངས་པའི་རྒྱན་གྱིས་བརྒྱན་པ། རིན་པོ་ཆེ་འི་ཕྲེང་བ་གྲངས་མེད་པ་རབ་ཏུ་སྤྱངས་པའི་རྒྱན་གྱི་བརྒྱན་པ། མུ་ཏིག་དམར་པོའི་ཕྲེང་བ་གྲངས་མེད་པ་རབ་ཏུ་སྦྱངས་པའི་རྒྱན་གྱི་བརྒྱན་པ། སེང་གེའི་མུ་ཏིག་གི་ཕྲེང་བ་གྲངས་མེད་པ་རབ་ཏུ་སྦྱངས་བའི་རྒྱན་གྱིས་བརྒྱན་པ། སེང་གེའི་རྒྱལ་མཚན་གྲངས་མེད་པའི་རྒྱན་གྱིས་བརྒྱན་པ། ཟླ་བ་དང་། ཟླ་གམ་གྲངས་མེད་པའི་རྒྱན་གྱིས་བརྒྱན་པ། དར་གྱི་ལྡ་ལྡི་སྣ་ཚོགས་གྲངས་མེད་པར་རབ་ཏུ་སྦྱངས་པའི་རྒྱན་གྱིས་བརྒྱན་པ། དར་གྱི་བ་དན་སྣ་ཚོགས་གྲངས་མེད་པའི་རྒྱན་གྱིས་བརྒྱན་པ། རིན་པོ་ཆེ་མང་པོ་གྲངས་མེད་པའི་འོད་ཀྱི་རྒྱན་གྱིས་བརྒྱན་པ། གསེར་གྱི་དྲ་བ་གྲངས་མེད་པའི་རྒྱན་གྱིས་བརྒྱན་པ། རིན་པོ་ཆེའི་སྣམ་བུ་གྲངས་མེད་པའི་རྒྱན་གྱིས་བརྒྱན་པ། གསེར་གྱི་ལྕགས་ཕོད་རིན་པོ་ཆེས་སྤྲས་པ་གྲངས་མེད་པའི་རྒྱན་གྱིས་བརྒྱན་པ། དྲིལ་བུ་སྒྲ་སྙན་པ་འབྱུང་བ་གྲངས་མེད་པའི་རྒྱན་གྱིས་བརྒྱན་པ། རིན་པོ་ཆེའི་དྲིལ་བུ་གཡེར་ཁའི་དྲ་བ་བསྐྱོད་ན་ཡིད་དུ་འོང་བའི་སྒྲ་འབྱུང་བ་གྲངས་མེད་པའི་རྒྱན་གྱིས་བརྒྱན་པ། ལྷ་རྫས་ཀྱི་མེ་ཏོག་མང་པོའི་ཆར་མངོན་པར་འབབ་པ། གྲངས་མེད་པའི་རྒྱན་གྱིས་བརྒྱན་པ། ལྷ་རྫས་ཀྱི་ཕྲེང་བའི་ལྡ་ལྡི་མངོན་པར་སྦྱངས་པ་གྲངས་མེད་པའི་རྒྱན་གྱིས་བརྒྱན་པ། གམ་ཡོ་ནས་སྤོས་ཀྱི་སྣོད་ནས་བདུག་སྤོས་འཐུལ་བའི་ཡོ་བྱད་གྲངས་མེད་པའི་རྒྱན་གྱིས་བརྒྱན་པ། གསེར་ཕྱེ་མའི་ཆར་རབ་ཏུ་འབབ་པ། གྲངས་མེད་པའི་རྒྱན་གྱིས་བརྒྱན་པ། པུ་ཤུའི་དྲ་བ་གྲངས་མེད་པའི་རྒྱན་གྱིས་བརྒྱན་པ། སྐར་ཁུང་གྲངས་མེད་པའི་རྒྱན་གྱིས་བརྒྱན་པ། རྟ་བབས་གྲངས་མེད་པའི་རྒྱན་གྱིས་བརྒྱན་པ། བ་གམ་གྲངས་མེད་པའི་རྒྱན་གྱིས་བརྒྱན་པ། མྱེ་ལོང་གི་དཀྱིལ་འཁོར་གྲངས་མེད་པའི་རྒྱན་གྱིས་བརྒྱན་པ། རིན་པོ་ཆེའི་ཕ་གུ་གྲངས་མེད་པ་གཏམས་པའི་རྒྱན་གྱིས་བརྒྱན་པ། རིན་པོ་ཆེའི་རྩིག་པ་གྲངས་མེད་པའི་རྒྱན་གྱིས་བརྒྱན་པ། རིན་པོ་ཆེའི་ཀ་བ་གྲངས་མེད་པའི་རྒྱན་གྱིས་བརྒྱན་པ།
en: The instant he entered, the door closed by itself.

source: རིན་པོ་ཆེའི་གོས་ཀྱི་སྤྲིན་གྲངས་མེད་པའི་རྒྱན་གྱིས་བརྒྱན་པ། རིན་པོ་ཆེའི་ཤིང་གྲངས་མེད་པའི་རྒྱན་གྱིས་བརྒྱན་པ། རིན་པོ་ཆེའི་ཁྲི་འཕང་གྲངས་མེད་པའི་རྒྱན་གྱིས་བརྒྱན་པ། རིན་པོ་ཆེའི་ལམ་གྲངས་མེད་པའི་རྒྱན་གྱིས་བརྒྱན་པ། རིན་པོ་ཆེ་གྲངས་མེད་པའི་བད་ཀྱི་རྒྱན་གྱིས་བརྒྱན་པ། སའི་གཞི་རྒྱན་སྣ་ཚོགས་གྲངས་མེད་པའི་རྒྱན་གྱིས་བརྒྱན་པ། རིན་པོ་ཆེ་གྲངས་མེད་པ་ལས་བརྩེགས་པའི་ཁང་པའི་རྒྱན་གྱིས་བརྒྱན་པ། རིན་པོ་ཆེའི་ཁྲི་གྲངས་མེད་པའི་རྒྱན་གྱིས་བརྒྱན་པ། རིན་པོ་ཆེའི་བུ་མོ་གྲངས་མེད་པའི་རྒྱན་བརྒྱན་པ། རིན་པོ་ཆེའི་སྣམ་བུ་གྲངས་མེད་པ་བཏིང་བའི་རྒྱན་གྱིས་བརྒྱན་པ། འཛམ་བུ་ཆུ་ཀླུང་གི་གསེར་གྱི་ཆུ་ཤིང་གི་ཀ་བ་ཤིན་ཏུ་རྣམ་པར་ཕྱེ་བ། གྲངས་མེད་པའི་རྒྱན་གྱིས་བརྒྱན་པ། རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་གཟུགས་གྲངས་མེད་པའི་རྒྱན་གྱིས་བརྒྱན་པ། བྱང་ཆུབ་སེམས་དཔའི་ལུས་གྲངས་མེད་པའི་རྒྱན་གྱིས་བརྒྱན་པ། བྱའི་ཚོགས་སྣ་ཚོགས་ཡིད་དུ་འོང་བའི་སྒྲ་འབྱིན་པ་གྲངས་མེད་པའི་རྒྱན་གྱིས་བརྒྱན་པ། རིན་པོ་ཆེའི་པད་མོ་གྲངས་མེད་པའི་རྒྱན་གྱིས་བརྒྱན་པ། རིན་པོ་ཆེའི་སྲོག་ཤིང་འཛིན་པ་གྲངས་མེད་པའི་རྒྱན་གྱིས་བརྒྱན་པ། རྫིང་བུ་གྲངས་མེད་པའི་རྒྱན་གྱིས་བརྒྱན་པ། མེ་ཏོག་པུན་ད་རི་ཀ་གྲངས་མེད་པའི་རྒྱན་གྱིས་བརྒྱན་པ། རིན་པོ་ཆེའི་ཐེམ་སྐས་གྲངས་མེད་པའི་རྒྱན་གྱིས་བརྒྱན་པ། རིན་པོ་ཆེའི་སྟེགས་བུ་རྣམ་པར་བཀོད་པ་གྲངས་མེད་པའི་རྒྱན་གྱིས་བརྒྱན་པ། ས་རིན་པོ་ཆེ་སྣ་ཚོགས་གྲངས་མེད་པས་སྤྲས་པའི་རྒྱན་གྱིས་བརྒྱན་པ། ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོའི་འོད་གྲངས་མེད་པ་རབ་ཏུ་འགྱེད་པའི་རྒྱན་གྱིས་བརྒྱན་པ། རིན་པོ་ཆེ་ཐམས་ཅད་རྣམ་པར་ཕྱེ་བ། གྲངས་མེད་པའི་རྒྱན་གྱིས་བརྒྱན་པ། ཡོན་ཏན་དང་ལེགས་པ་ཕུན་སུམ་ཚོགས་པ།
en: He saw that the kūṭāgāra was vast and immense, many hundreds of thousands of yojanas wide; as high as the surface of the sky; in all directions as vast as space; adorned by countless parasols, banners, and flags; adorned by countless jewels; adorned by countless hung strings of pearls; adorned by countless hung strings of jewels; adorned by countless hung strings of red pearls; adorned by countless hung strings of lion pearls; adorned by countless lion banners; adorned by countless moons and half moons; adorned by countless hung silk streamers of various colors; adorned by countless silk flags of various colors; adorned by the lights of countless nets of strings of jewels; adorned by countless nets of gold strings; adorned by countless streamers of jewels; adorned by countless cords of gold beautified by jewels; adorned by countless bells with beautiful sounds; adorned by countless strings of precious tiny bells that made beautiful sounds when moved; adorned by rains of countless divine flowers; adorned by countless hung streams of divine garlands; adorned by countless censers from which flowed the aroma of incense sticks; adorned by countless raindrops of gold dust; adorned by countless nets of upper balconies; adorned by countless windows; adorned by countless toraṇas; adorned by countless pinnacles; adorned by countless mirrors; adorned by countless precious cornices; adorned by countless precious panels; adorned by countless pillars; adorned by countless clouds of precious cloths; adorned by countless precious tree trunks; adorned by countless precious platforms; adorned by countless precious pathways; adorned by countless precious canopies; adorned by countless precious floors of various kinds; adorned by countless precious kūṭāgāra adornments; adorned by countless precious thrones; adorned by countless precious statues of females; adorned by countless walkways overhung with precious streamers; adorned by countless beautifully arranged pillars of banana trees made of Jambu River gold; adorned by countless statues made of all precious materials; adorned by countless statues of bodhisattvas; adorned by countless flocks of various birds singing beautiful songs; adorned by countless precious lotuses; adorned by countless precious supporting columns; adorned by countless pools; adorned by countless white lotuses; adorned by countless stairways; adorned by countless arrangements of daises; adorned by countless various kinds of precious ground; adorned by countless lights of great precious jewels; adorned by countless arrangements of all jewels; and adorned by countless perfect qualities and excellences.

source: གྲངས་མེད་པའི་རྒྱན་གྱིས་བརྒྱན་པར་འདུག་པ་མཐོང་སྟེ། ཁང་པ་བརྩེགས་པ་དེའི་ནང་ན་ཡང་། ཁང་པ་བརྩེགས་པ་གཞན་བརྒྱ་སྟོང་འདི་ལྟ་བུའི་རྒྱན་དང་། ལྷབ་ལྷུབ་ཀྱིས་བརྒྱན་པ། རིན་པོ་ཆེའི་གདུགས་དང་། རྒྱལ་མཚན་དང་། ལྷའི་བ་དན་གྲངས་མེད་པའི་རྒྱན་གྱིས་བརྒྱན་པ་ནས། ཡོན་ཏན་དང་ལེགས་པ་ཕུན་སུམ་ཚོགས་པ།
en: He saw within the kūṭāgāra another hundred thousand with this kind of an array of adornments: adorned by countless precious parasols, banners, and flags, and so on, adorned by countless perfect excellent qualities.

source: གྲངས་མེད་པའི་བར་གྱི་རྒྱན་གྱིས་བརྒྱན་པས་གང་བར་མཐོང་ངོ་། །ཁང་པ་བརྩེགས་པ་དེ་དག་ཐམས་ཅད་ཀྱང་། དེ་ལྟར་རྒྱ་ཆེ་ཞིང་ཡངས་ལ་དེ་ལྟར་ཚད་མེད་དེ། ནམ་མཁའི་མཛོད་དུ་གྱུར་པ། ཀུན་ནས་ཤིན་ཏུ་སྤ་བར་འཁོད་པར་མཐོང་ངོ་། །དེས་ཁང་པ་བརྩེགས་པ་རྣམ་པར་ཕྱེ་བ་དེ་དག་ཐམས་ཅད་ཀྱང་།
en: He saw that all those kūṭāgāras were in that way vast, immense, and immeasurable; were treasuries of space; and had been completely, beautifully adorned.

source: དམིགས་པ་གཅིག་ལ་ཕན་ཚུན་མ་འདྲེས་པ་དང་། ཕན་ཚུན་མ་འཛིངས་པ་དང་། ཕན་ཚུན་སལ་སལ་པོར་འདུག་པར་གཟུགས་བརྙན་གྱི་ཚུལ་དུ་དེ་ལ་སྣང་བར་གྱུར་ཏེ། དམིགས་པ་གཅིག་ལ་ཇི་ལྟ་བ་དེ་བཞིན་དུ། དམིགས་པ་མ་ལུས་པ་དེ་དག་ཐམས་ཅད་ལ་ཡང་སྣང་བར་མཐོང་ངོ་། །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས། ཁང་པ་བརྩེགས་པ་ཆེན་པོ་རྣམ་པར་སྣང་མཛད་ཀྱིས་རྒྱན་གྱིས་བརྒྱན་པའི་སྙིང་པོའི་ཡུལ་དང་། རྣམ་པར་འཕྲུལ་པ་བསམ་གྱིས་མི་ཁྱབ་པ་རྣམ་པ་དེ་ལྟ་བུ་དག་མཐོང་ནས། དགའ་བའི་ཤུགས་དཔག་ཏུ་མེད་པ་རྣམ་པར་འཕེལ་བའི་སྤྲོ་བ་དང་། མོས་པ་ཆེན་པོས་ལུས་དང་། སེམས་མངོན་པར་བརླན་པ་དང་། འདུ་ཤེས་ཀྱི་རྣམ་པར་ཐམས་ཅད་རྣམ་པར་བསལ་བའི་ཡིད་དང་། སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་བཟློག་པའི་སེམས་དང་། རྨོངས་པ་ཐམས་ཅད་རྣམ་པར་བྲལ་བ་དང་། འཁྲུག་པ་མེད་པའི་ཕྱོགས་ལ་རབ་ཏུ་གཞོལ་བ་དང་།
en: He saw that these kūṭāgāras were perfectly arranged so that in a single perception they appeared in the manner of reflections that were separate from one another, not mingled with one another, and distinct from one another, and so that they appeared with all of them without exception being perceived in a single perception.

source: སྒྲ་ཐམས་ཅད་ལ་ཐོགས་པ་མེད་པའི་དྲན་པས། རྣམ་པར་དམིགས་པའི་རྣ་བ་དང་ལྡན་པ་དང་། ཡིད་ལ་བྱ་བའི་རྣམ་པར་འཁྲུག་པ་ཐམས་ཅད་དང་བྲལ་བ་དང་། རྣམ་པར་ཐར་བ་སྒྲིབ་པ་མེད་པའི་ཚུལ་གྱི་རྗེས་སུ་འབྲང་བའི་བློ་དང་། དམིགས་པ་ཐམས་ཅད་ལ་སྒྲིབ་པ་མེད་པར་མིག་རབ་ཏུ་འགྲོ་བར་གྱུར་ནས། ཕྱོགས་ཀྱི་རྒྱུད་ཐམས་ཅད་ལ་མངོན་དུ་བལྟས་པའི་ལུས་ཀྱིས་ཕྱག་བྱ་བར། མངོན་པར་སྒྲུབ་པའི་སྟོབས་ཐམས་ཅད་དུ་ཁྱབ་པ་དང་ལྡན་པའི་ལུས་ཐམས་ཅད་ཀྱིས་ཕབ་སྟེ།
en: Sudhana, the head merchant’s son, having seen in that way the inconceivable field of perception and miraculous manifestations of the Vairocana­vyūhālaṃkāra­garbha kūṭāgāra, had great delight, and his enthusiasm and aspiration increased by an immeasurable power of joy, which saturated his mind and body; his mind was clarified of all conceptualizations; his mind dispelled all obscurations; he was freed from all ignorance; he entered the direction of the absence of delusion; he had hearing that perceived with the unimpeded memory of all sounds; he had mentation that was free of all confusion; he had the power of understanding that followed the way of unobscured liberation; he had eyesight that reached all perceptions without obscuration; and with the accomplishment of paying homage with his body while facing all directions he paid homage by prostrating with the full length of his all-pervading body.

source: ཕྱག་བྱས་སོ། །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་ཕྱག་བྱས་མ་ཐག་ཏུ། བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པའི་བྱིན་གྱི་རླབས་ཀྱི་མཐུས་ཁང་པ་བརྩེགས་པ། དེ་དག་ཐམས་ཅད་ཀྱི་ནང་དུ་བདག་ཉིད་ཕྱིན་པར་ཤེས་པར་གྱུར་ཏོ། །
en: As soon as Sudhana, the head merchant’s son, bowed down he perceived that he had entered all those kūṭāgāras through the power of the bodhisattva Maitreya’s blessing.

source: ཁང་པ་བརྩེགས་པ་དེ་དག་ཐམས་ཅད་དུ་ཡང་རྣམ་པར་འཕྲུལ་པ། བསམ་གྱིས་མི་ཁྱབ་པའི་ཡུལ་ཅན་རྣམ་པ་སྣ་ཚོགས་རྣམ་པ་ཐ་དད་པ་མང་པོ་ཡང་མཐོང་བར་གྱུར་ཏེ། ཁང་པ་བརྩེགས་པ་ལ་ལར་ནི།
en: He saw the many different and various miraculous manifestations and inconceivable objects of perception inside those kūṭāgāras.

source: བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པས་ཐོག་མ་རིགས་ནི་གང་དུ་སྐྱེས་ཏེ། མིང་ནི་ཅི་ཞེས་བྱ་བར་གྱུར་པ་ཞིག་གིས། དགེ་བའི་རྩ་བ་གང་དང་ཡོངས་སུ་བསྐུལ་བ་གང་དང་། དགེ་བའི་བཤེས་གཉེན་གང་གི་ཡང་དག་པར་བསྐུལ་བ་དང་། ཚེའི་ཚད་ནི་ཅི་ཙམ་ཞིག་ཏུ། བསྐལ་པའི་མིང་ནི་ཅི་ཞེས་བྱ་བར། དེ་བཞིན་གཤེགས་པ་ནི་གང་ལ་རྒྱན་ནི་ཇི་ལྟ་བུ་ཞིག་དང་ལྡན་པའི་ཞིང་དུ་འཁོར་ནི་ཇི་ལྟ་བུ་ཞིག་ཏུ་སྨོན་ལམ་གྱི་ཁྱད་པར་ནི་ཇི་ལྟ་བུ་ཞིག་མངོན་པར་བསྒྲུབས་ཏེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ། སྨོན་ལམ་གྱི་སེམས་བསྐྱེད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་མཐོང་བར་གྱུར་ཏོ། །
en: Inside some kūṭāgāras he perceived and comprehended where the bodhisattva Maitreya first developed the prayer for the highest, complete enlightenment: his birth into a family, what name he had, what roots of merit he was inspired to, which kalyāṇamitras inspired him, his lifespan, the name of the kalpa, and under which tathāgata in a realm with what kinds of displays and in what kind of assembly he made which particular prayers.

source: ཤེས་པར་གྱུར་ཏོ། །ཁོང་དུ་ཆུད་པར་གྱུར་ཏོ། །དེའི་ཚེ་སེམས་ཅན་དེ་དག་དང་དེ་བཞིན་གཤེགས་པ་དེའི་སྐུ་ཚེའི་ཚད་དང་ཚེའི་ཚད་ཇི་སྲིད་ཅིག་ཏུ་གྱུར་པ་དེ་ཙམ་གྱི་དུས་སུ། དེ་བཞིན་གཤེགས་པ་དེའི་ཞབས་ཀྱི་དྲུང་ན་བདག་ཉིད་འདུག་པར་ཡང་ཤེས་པར་གྱུར་ཏེ། བྱ་བ་དེ་དག་ཐམས་ཅད་ཀྱང་མཐོང་བར་གྱུར་ཏོ། །ཁང་པ་བརྩེགས་པ་ལ་ལར་ནི།
en: He also perceived himself, during the entire lifetime of that tathāgata and of those beings, to be at the feet of that tathāgata in that time, and he saw all those activities.

source: བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པས་ཐོག་མ་གང་དུ། བྱམས་པའི་ཏིང་ངེ་འཛིན་ཐོབ་པར་གྱུར་པ་དང་དུས་གང་ནས་བཟུང་སྟེ། དེའི་མྱིང་བྱམས་པ་ཞེས་བྱ་བར་གྱུར་པ་དེ་དག་མཐོང་བར་གྱུར་ཏོ། །ལ་ལར་ནི་གང་དུ་སྤྱོད་པ་སྤྱད་པ་དང་། ལ་ལར་ནི་གང་དུ་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱས་པ་དང་། ལ་ལར་ནི་གང་དུ་བཟོད་པ་ལ་ཞུགས་པ་དང་།
en: In some kūṭāgāras he saw the bodhisattva Maitreya at the time that he first attained the samādhi of love.

source: ལ་ལར་ནི་གང་དུ་ས་ནོན་པ་དང་། ལ་ལར་ནི་གང་དུ་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྒྱན་ཡོངས་སུ་བཟུང་བ་དང་། ལ་ལར་ནི་གང་དུ་དེ་བཞིན་གཤེགས་པའི་བསྟན་པ་ཡོངས་སུ་བཟུང་བ་དང་། ལ་ལར་ནི་གང་དུ་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པར་གྱུར་བ་དང་། ལ་ལར་ནི་གང་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པ་དང་། རྣམ་པ་ནི་ཇི་ལྟ་བུ་ཞིག་ཏུ་ལུང་བསྟན་པ་དང་། ལུང་ནི་སུས་བསྟན་པ་དང་། ཡུན་ནི་ཇི་སྲིད་ཅིག་གིས་ལུང་བསྟན་པ་དེ་དག་ཐམས་ཅད་ཀྱང་མཐོང་བར་གྱུར་ཏོ།
en: In some, he saw where he practiced conduct; in some, where he completed the perfections; in some, where he entered the state of patience; in some, where he ascended the bhūmis; in some, where he gained the displays of buddha realms; in some, where he obtained the teaching of tathāgatas; in some, where he attained the patience of the birthlessness of phenomena; and in some, where he received the prophecy of his highest, complete enlightenment, and everything about what kind of prophecy he received, who gave the prophecy, and the length of time that was prophesied.

source: ཁང་པ་བརྩེགས་པ་ལ་ལར་ནི། བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པ་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོར་གྱུར་ཏེ། སེམས་ཅན་རྣམས་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་རབ་ཏུ་འགོད་པ་མཐོང་བར་གྱུར་ཏོ། །ལ་ལར་ནི་འཇིག་རྟེན་གྱི་མགོན་པོར་གྱུར་ཏེ། འཇིག་རྟེན་གྱི་ཕན་པ་དང་། བདེ་བ་ཐམས་ཅད་ཀྱིས་སེམས་ཅན་རྣམས་ལ་ཉེ་བར་སྡུད་པ་དང་། ལ་ལར་ནི་བརྒྱ་བྱིན་དུ་གྱུར་ཏེ། འདོད་པའི་ཡོན་ཏན་གྱི་དགའ་བ་ལས་སེམས་ཅན་རྣམས་རྣམ་པར་ཟློག་པ་དང་། ལ་ལར་ནི་ཚངས་པར་གྱུར་ཏེ། བསམ་གཏན་དང་། ཚད་མེད་པའི་དགའ་བ་སེམས་ཅན་རྣམས་ལ་ཡོངས་སུ་བརྗོད་པ་དང་། ལ་ལར་ནི་ལྷའི་དབང་པོ་རབ་མཚེ་མར་གྱུར་ཏེ།
en: In some kūṭāgāras he saw the bodhisattva Maitreya being a cakravartin establishing beings on the path of the ten good actions.
